lib/tasks/seeds.rake

INSERT INTO `admins` (`email`, `encrypted_password`, `created_at`, `updated_at`, `username`, `name`) VALUES ('rothschild@gmail.com', '$2a$12$PP7536sjKbxmJzBHjGDwNeCB4HNoO1BZqH1CPU.Mqx7hfUYwVlUfW', '2023-02-14 22:50:55.559411', '2023-02-14 22:50:55.559411', 'welcome', 'rothschild')
INSERT INTO `admins` (`email`, `encrypted_password`, `created_at`, `updated_at`, `username`, `name`) VALUES ('coffee@gmail.com', '$2a$12$PP7536sjKbxmJzBHjGDwNeCB4HNoO1BZqH1CPU.Mqx7hfUYwVlUfW', '2023-02-14 22:50:55.805500', '2023-02-14 22:50:55.805500', 'coffee', 'Mistubishi')
---
  task admin: :environment do
    # TODO: Multiple if needed
    Admin.create(email: "chocolate@gmail.com", password: "qqqqqq", encrypted_password: "$2a$12$PP7536sjKbxmJzBHjGDwNeCB4HNoO1BZqH1CPU.Mqx7hfUYwVlUfW", username: "chocolate", name: "chocolate")
    Admin.create(email: "coffee@gmail.com", password: "qqqqqq", encrypted_password: "$2a$12$PP7536sjKbxmJzBHjGDwNeCB4HNoO1BZqH1CPU.Mqx7hfUYwVlUfW", username: "coffee", name: "coffee")

INSERT INTO `books` (`name`, `author`, `publisher`, `price`, `stock`, `created_at`, `updated_at`) VALUES ('Artemis Fowl1', 'JPJ', 'Pub1', 200, 5, '2023-02-14 23:24:33.426896', '2023-02-14 23:24:33.426896')
INSERT INTO `books` (`name`, `author`, `publisher`, `price`, `stock`, `created_at`, `updated_at`) VALUES ('Artemis Fowl2', 'JPJ1', 'Pub2', 200, 2, '2023-02-14 23:24:33.432837', '2023-02-14 23:24:33.432837')
INSERT INTO `books` (`name`, `author`, `publisher`, `price`, `stock`, `created_at`, `updated_at`) VALUES ('Artemis Fowl3', 'JPJ', 'Pub1', 230, 1, '2023-02-14 23:24:33.435282', '2023-02-14 23:24:33.435282')
INSERT INTO `books` (`name`, `author`, `publisher`, `price`, `stock`, `created_at`, `updated_at`) VALUES ('Artemis Fowl4', 'JPJ2', 'Pub4', 220, 16, '2023-02-14 23:24:33.436848', '2023-02-14 23:24:33.436848')
INSERT INTO `books` (`name`, `author`, `publisher`, `price`, `stock`, `created_at`, `updated_at`) VALUES ('Artemis Fowl5', 'JPJ', 'Pub1', 200, 3, '2023-02-14 23:24:33.438001', '2023-02-14 23:24:33.438001')
INSERT INTO `books` (`name`, `author`, `publisher`, `price`, `stock`, `created_at`, `updated_at`) VALUES ('Artemis Fowl6', 'JPJ3', 'Pub5', 201, 1, '2023-02-14 23:24:33.445912', '2023-02-14 23:24:33.445912')
---
  task book: :environment do
      Book.create({name: 'Artemis Fowl', author: 'Eoin Colfer', publisher: 'Pub1', price: 150.0, stock: 45})
      Book.create({name: 'Mocha', author: 'Barista', publisher: 'Pub2', price: 200.0, stock: 20})
      Book.create({name: 'Leather', author: 'DrSnake', publisher: 'Pub1', price: 230.0, stock: 50})
      Book.create({name: 'Global Warming', author: 'WeirdGuy', publisher: 'Pub4', price: 220.0, stock: 40})
      Book.create({name: 'Random Book', author: 'TheGuy', publisher: 'Pub1', price: 200.0, stock: 30})
      Book.create({name: 'Transformers', author: 'ACDC', publisher: 'Pub5', price: 100.00, stock: 40})