app/controllers/admin_controller.rb

UPDATE `admins` SET `admins`.`email` = 'rrothschild@gmail.com', `admins`.`updated_at` = '2023-02-14 23:21:57.754024', `admins`.`name` = 'Roth' WHERE `admins`.`id` = 4
---
  def update
    admin_params_empty_pass = admin_params.reject {|k, v| v == "" and k == 'password'}
    respond_to do |format|
      if @admin.update(admin_params_empty_pass)

SELECT `admins`.* FROM `admins` WHERE `admins`.`id` = 4 LIMIT 1
---
  def set_admin
    @admin = Admin.find(params[:id])