app/controllers/books_controller.rb

  def destroy
    @book.destroy
---
DELETE FROM `books` WHERE `books`.`id` = 1

    def set_book
      @book = Book.find(params[:id])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 7 LIMIT 1