app/controllers/books_controller.rb

  def index
    @filtered = false
    if(params[:author].nil? or params[:author].empty?)
      @books = Book.all
    else
      @filtered = true
      @books = Book.where(author: params[:author])
    end

    @ratings = []
    if(params[:rating].present?)
      @filtered = true
      booksAboveRating = []
      @books.each do |b|
        reviews = Review.where(book_id: b.id)
        if(reviews.present?)
          rating = (reviews.map(&:rating).inject(:+).to_f)/reviews.size
          if(rating >= params[:rating].to_f)
            booksAboveRating.push(b)
            @ratings.push(rating)
          end
        end
      end
      @books = booksAboveRating
    else
      @books.each do |b|
        reviews = Review.where(book_id: b.id)
        if(reviews.empty?)
          @ratings.push("No reviews yet")
        else
          @ratings.push((reviews.map(&:rating).inject(:+).to_f)/reviews.size)
---
SELECT `books`.* FROM `books`
SELECT `books`.* FROM `books` WHERE `books`.`author` = 'JPJ'
SELECT 1 AS one FROM `reviews` WHERE `reviews`.`book_id` = 1 LIMIT 1
INSERT INTO `books` (`name`, `author`, `publisher`, `price`, `stock`, `created_at`, `updated_at`) VALUES ('Stupid book', 'Joke Rowling', 'RabbitMQ', 100, 100, '2023-02-15 02:39:48.204723', '2023-02-15 02:39:48.204723')
UPDATE `books` SET `books`.`name` = 'Firefliesx', `books`.`author` = 'Today was ax', `books`.`publisher` = 'Fairytalex', `books`.`price` = 111, `books`.`stock` = 1, `books`.`updated_at` = '2023-02-15 07:09:46.690964' WHERE `books`.`id` = 9

  def show
    cart = Cart.where(user_id: current_user.id).order("created_at").last
    cart_detail = CartDetail.where(cart_id: cart.id, book_id: @book.id)
    if cart_detail.empty?
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`user_id` = 1 ORDER BY created_at DESC LIMIT 1
SELECT 1 AS one FROM `cart_details` WHERE `cart_details`.`cart_id` = 1 AND `cart_details`.`book_id` = 1 LIMIT 1

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO `books` (`name`, `author`, `publisher`, `price`, `stock`, `created_at`, `updated_at`) VALUES ('Stupid book', 'Joke Rowling', 'RabbitMQ', 100, 100, '2023-02-15 02:39:48.204723', '2023-02-15 02:39:48.204723')

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE `books` SET `books`.`name` = 'Firefliesx', `books`.`author` = 'Today was ax', `books`.`publisher` = 'Fairytalex', `books`.`price` = 111, `books`.`stock` = 1, `books`.`updated_at` = '2023-02-15 07:09:46.690964' WHERE `books`.`id` = 9

  def destroy
    @book.destroy
---
DELETE FROM `books` WHERE `books`.`id` = 1

    def set_book
      @book = Book.find(params[:id])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1