app/controllers/cart_details_controller.rb

  def index
    cart = Cart.where(user_id: current_user.id).order("created_at").last
    @cart_details = CartDetail.where(cart_id: cart.id)
    @cartHasItems = @cart_details.present?
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`user_id` = 1 ORDER BY created_at DESC LIMIT 1
SELECT `cart_details`.* FROM `cart_details` WHERE `cart_details`.`cart_id` = 1