app/controllers/carts_controller.rb

  def add_to_cart
    cart = Cart.where(user_id: current_user.id).order("created_at").last
    cart_detail = CartDetail.where(cart_id: cart.id, book_id: params[:book_id])
    if cart_detail.empty?
      CartDetail.create(cart_id: cart.id, book_id: params[:book_id], quantity: params[:quantity])
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`user_id` = 1 ORDER BY created_at DESC LIMIT 1
SELECT 1 AS one FROM `cart_details` WHERE `cart_details`.`cart_id` = 1 AND `cart_details`.`book_id` = 1 LIMIT 1
INSERT INTO `cart_details` (`quantity`, `created_at`, `updated_at`, `book_id`, `cart_id`) VALUES (2, '2023-02-16 04:10:03.128575', '2023-02-16 04:10:03.128575', 1, 1)

    def set_cart
      @cart = Cart.find(params[:id])
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 1 LIMIT 1