app/controllers/home_controller.rb

    def create_cart
      if(!current_user.nil?)
        carts = Cart.where(user_id: current_user.id)
        purchases = Purchase.where(cart_id: carts)
        if(carts.nil? == true || carts.size == purchases.size)
          Cart.create(user_id: current_user.id)
---
SELECT COUNT(*) FROM `carts` WHERE `carts`.`user_id` = 1
SELECT COUNT(*) FROM `purchases` WHERE `purchases`.`cart_id` IN (SELECT `carts`.`id` FROM `carts` WHERE `carts`.`user_id` = 1)
INSERT INTO `carts` (`created_at`, `updated_at`, `user_id`) VALUES ('2023-02-16 03:47:03.277102', '2023-02-16 03:47:03.277102', 1)