app/controllers/purchases_controller.rb

SELECT `cart_details`.* FROM `cart_details` WHERE `cart_details`.`cart_id` = 1
---
  def new
    @cart_id = params[:cart_id]
    cart_details = CartDetail.where(cart_id: params[:cart_id]).map(&:quantity)
    book_prices = CartDetail.where(cart_id: params[:cart_id]).map(&:book).map(&:price)

SELECT `cart_details`.* FROM `cart_details` WHERE `cart_details`.`cart_id` = 1
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1
UPDATE `books` SET `books`.`stock` = 3, `books`.`updated_at` = '2023-02-16 04:10:37.349844' WHERE `books`.`id` = 1
INSERT INTO `purchases` (`credit_card`, `phone_number`, `address`, `total_price`, `created_at`, `updated_at`, `user_id`, `cart_id`) VALUES (9999999999999999, 9999999911, 'sdfghj', 400, '2023-02-16 04:10:37.377362', '2023-02-16 04:10:37.377362', 1, 1)
---
  def create
    @purchase = Purchase.new(purchase_params)
    quantity_details = CartDetail.where(cart_id: purchase_params[:cart_id]).map(&:quantity)
    puts "qd: ", quantity_details
    book_ids = CartDetail.where(cart_id: purchase_params[:cart_id]).map(&:book_id)
    puts "bi: ", book_ids
    books = Book.where(id: book_ids)
    puts "books: ", books

    books.each_with_index do |b, i|
      books[i].stock = books[i].stock - quantity_details[i]
      books[i].save!
    end

    respond_to do |format|
      if @purchase.save

SELECT `purchases`.* FROM `purchases` WHERE `purchases`.`id` = 1 LIMIT 1
---
    def set_purchase
      @purchase = Purchase.find(params[:id])