app/controllers/purchases_controller.rb

SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
---
  def create
    @purchase = Purchase.new(purchase_params)
    quantity_details = CartDetail.where(cart_id: purchase_params[:cart_id]).map(&:quantity)
    book_ids = CartDetail.where(cart_id: purchase_params[:cart_id]).map(&:book_id)
    books = Book.where(id: book_ids)