app/controllers/purchases_controller.rb

  def new
    @cart_id = Cart.where(user_id: current_user.id).order("created_at").last.id
    cart_details = CartDetail.where(cart_id: @cart_id).map(&:quantity)
    book_prices = CartDetail.where(cart_id: @cart_id).map(&:book).map(&:price)
    @total_price = cart_details.zip(book_prices).map{|x, y| x * y}.inject(:+)
    @purchase = Purchase.new

    values_to_check = [:credit_card, :address, :phone_number]
    @values_to_notify = []

    # Prefill values else notify
    values_to_check.each do |val|
      unless current_user.send(val).nil? or current_user.send(val).empty?
        @purchase.send((val.to_s + '=').to_sym, current_user.send(val))
      else
        @values_to_notify << val
      end
    end

    user = User.find_by(id: current_user.id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 1 LIMIT 1