app/controllers/reviews_controller.rb

  def index
    @reviews = Review.all
    @selectedUser = ""
    @selectedBook = ""
    if(!params[:author].nil?)
      @reviews = Review.where(user_id: params[:author])
      @selectedUser = params[:author]
    elsif(!params[:book].nil?)
      @reviews = Review.where(book_id: params[:book])
      @selectedBook = params[:book]
    end
    @book_names = []
    @reviews.each do |r|
      @book_names.push(Book.find_by(id: r.book_id).name)
    end
    @people = User.all
---
SELECT `reviews`.* FROM `reviews`
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`user_id` = 17
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`book_id` = 1
SELECT `books`.* FROM `books`
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`user_id` = 1
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users`

  def show
    if(@review.user_id)
      @user = User.find_by(id: @review.user_id)
    else
      @admin = Admin.find_by(id: @review.admin_id)
    end
    @book = Book.find_by(id: @review.book_id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 20 LIMIT 1
SELECT `admins`.* FROM `admins` WHERE `admins`.`id` = 4 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 17 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 17 LIMIT 1
SELECT `books`.* FROM `books` WHERE `books`.`id` = 6 LIMIT 1

  def create
    @review = Review.new(review_params)

    respond_to do |format|
      if @review.save
---
INSERT INTO `reviews` (`rating`, `review`, `created_at`, `updated_at`, `user_id`, `book_id`) VALUES (1, 'Stupid book', '2023-02-15 07:01:59.866768', '2023-02-15 07:01:59.866768', 20, 2)

  def update
    rating = review_params['rating']
    review = review_params['review']
    review_params = {"book_id": @review.book_id, "user_id": @review.user_id, "rating": rating, "review": review}
    puts review_params

    respond_to do |format|
      if @review.update(review_params)
---
UPDATE `reviews` SET `reviews`.`rating` = 4, `reviews`.`review` = 'Stupid book maybe', `reviews`.`updated_at` = '2023-02-15 07:04:31.758664' WHERE `reviews`.`id` = 5

  def destroy
    @review.destroy
---
DELETE FROM `reviews` WHERE `reviews`.`id` = 4

    def set_review
      @review = Review.find(params[:id])
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 4 LIMIT 1