app/controllers/reviews_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 17 ORDER BY `users`.`id` ASC LIMIT 1
---
  def index
    @reviews = Review.all
    @selectedUser = ""
    @selectedBook = ""
    if(params[:user].present?)
      @reviews = Review.where(user_id: params[:user])
      @selectedUser = params[:user]
    elsif(params[:book].present?)
      @reviews = Review.where(book_id: params[:book])
      @selectedBook = params[:book]
    end
    @book_names = []
    @user_names = []
    @reviews.each do |r|

SELECT `books`.* FROM `books` WHERE `books`.`id` = 4 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
---
  def show
    if(@review.user_id)
      @user = User.find_by(id: @review.user_id)
    else
      @admin = Admin.find_by(id: @review.admin_id)
    end
    @book = Book.find_by(id: @review.book_id)