app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT `users`.* FROM `users`

  def update
    non_empty_user_params = user_params.reject {|k, v| v == ""}
    respond_to do |format|
      if @user.update(non_empty_user_params)
---
UPDATE `users` SET `users`.`encrypted_password` = '$2a$12$92xjBn42.VTQYLS0oUvuTO90JtQvnVJwkpgMwL1lFaJuRLJatEla6', `users`.`updated_at` = '2023-02-15 00:57:07.179246' WHERE `users`.`id` = 8

  def destroy
    if current_user.present? and current_user.id == @user.id
      @user.destroy
      redirect_to destroy_user_session_path
    else
      @user.destroy
---
DELETE FROM `users` WHERE `users`.`id` = 8
DELETE FROM `users` WHERE `users`.`id` = 16

    def set_user
      @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1