app/views/reviews/index.html.erb

        <td><%= link_to 'Show', review %></td>
        <% if (current_admin.present? or review.user_id == current_user.id) %>
---
SELECT `users`.* FROM `users`